app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "9W7KeoxCsMaLyacCUEcFVQ"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    self.session_token = new_session_token
    while User.find_by(session_token: self.session_token)